modules/admin/controllers/ImageController.php

UPDATE `otk_image` SET `image`='', `povod_id`=3 WHERE `id`=16
---
    public function actionUpdate($id)
    {

        $model = $this->findModel($id);
        $image_name=$model->image;
//var_dump(Yii::$app->request->post());die;
        $p=\Yii::$app->request->post();
//        var_dump($p,$_POST);die;
        if ($model->load($p)&& $model->save() ) {

SELECT * FROM `otk_image` WHERE `id`='16'
---
    protected function findModel($id)
    {
        if (($model = Image::findOne($id)) !== null) {