modules/admin/controllers/PovodController.php

SELECT * FROM `otk_povod` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Povod::findOne($id)) !== null) {