modules/admin/models/Image.php

    public function getPovodlist(){
        $models=Povod::find()->asArray()->all();
---
SELECT * FROM `otk_povod`

    public function loadimage()
    {


            $image = UploadedFile::getInstanceByName($this, 'image_update');
//            var_dump($this->image);die;
            $name = explode(".", $image->name);
            $ext = end($name);
//        var_dump($this->title, $image->name);die;
            $this->image = (empty($this->image))?addslashes(Yii::$app->security->generateRandomString(32)) . '.' . $ext:$this->image;
            $path = Yii::$app->basePath . '/web' . Yii::$app->params['imagePath'] . $this->povod_id;
            if (!file_exists($path)) {
                mkdir($path);
            }
            //            var_dump($path);die;
            if ($this->save()) {
---
UPDATE `otk_image` SET `image`='xh0ktWVuW2FKi19Wf15XKQ-DTzK2xJ6p.jpg' WHERE `id`=16