modules/admin/models/Povod.php

    public function getFrendPovod()
    {
        return $this->hasMany(Frendpovod::className(), ['povod_id'=>'id' ])->viaTable('frends',['id'=>'frend_id'])->groupBy('email');
---
SELECT * FROM `frends` WHERE `frend_id`=2