modules/frends/controllers/FrendsController.php

SELECT * FROM `frends` WHERE (user_id=1) AND (`id`='3')
---
    protected function findModel($id)
    {
        if (($model = Frends::findOne($id)) !== null) {